// Написать метод, который определяет, какие элементы присутствуют в двух экземплярах 
// в каждом из массивов (= в двух и более, причем в каждом). 
// На вход подаются два массива. На выходе массив с необходимыми совпадениями.
// Пример:
// [7, 17, 1, 9, 1, 17, 56, 56, 23], [56, 17, 17, 1, 23, 34, 23, 1, 8, 1]
// На выходе [1, 17]

import getDoubled from "../tasks/5.js";

const str1 = "getDoubled([7, 17, 1, 9, 1, 17, 56, 56, 23], [56, 17, 17, 1, 23, 34, 23, 1, 8, 1]): ";
console.log(str1);
console.log(getDoubled(
  [7, 17, 1, 9, 1, 17, 56, 56, 23],
  [56, 17, 17, 1, 23, 34, 23, 1, 8, 1])
)

const str2 = "getDoubled([4, 12, 5, 12, 54, 12, 6, 8, 4], [56, 17, 17, 1, 4, 12, 34, 23, 4, 8, 4]): ";
console.log(str2);
console.log(getDoubled(
  [4, 12, 5, 12, 54, 12, 6, 8, 4],
  [56, 17, 17, 1, 4, 12, 34, 23, 4, 8, 4])
);
